{"sid": "1a2e88858cea92d4", "ego": 1744, "cur_time": 1.0, "future_time": 3.0, "rel_id": [1176, 1186, 1189, 1744, 1194, 1182, 1180], "rel_qa_id": [0, 1, 2, 3, 4, 5, 6], "env_q": ["Can you describe the type of intersection present in the current driving scenario?", "What is the ego agent's current proximity to the intersection center?", "Is there a speed bump in the vicinity of the ego agent?"], "env_a": ["The intersection is a 3 way intersection.", "The intersection center is 7.0 meters in front of the ego agent and 6.0 meters on the left of the ego agent.", "No."], "ego_q": ["What is the ego agent's current speed?", "What is the ego agent's current motion status?", "What is the ego agent's current activity within the intersection?", "In which direction is the ego agent moving?"], "ego_a": ["The ego agent's current speed is 2 m/s.", "The ego agent is decelerating.", "The ego agent is exiting the intersection.", "The ego agent is going straight."], "sur_q": ["What type of agent is surrounding agent #0?", "What is the current speed of surrounding agent #0?", "Where is surrounding agent #0 located in relation to the ego agent?", "What is the current position of surrounding agent #0 with respect to the intersection?", "What type of agent is surrounding agent #1?", "What is the current speed of surrounding agent #1?", "Where is surrounding agent #1 located in relation to the ego agent?", "What is the current position of surrounding agent #1 with respect to the intersection?", "What type of agent is surrounding agent #2?", "What is the current speed of surrounding agent #2?", "Where is surrounding agent #2 located in relation to the ego agent?", "What is the current position of surrounding agent #2 with respect to the intersection?", "What type of agent is surrounding agent #4?", "What is the current speed of surrounding agent #4?", "Where is surrounding agent #4 located in relation to the ego agent?", "What is the current position of surrounding agent #4 with respect to the intersection?", "What type of agent is surrounding agent #5?", "What is the current speed of surrounding agent #5?", "Where is surrounding agent #5 located in relation to the ego agent?", "What is the current position of surrounding agent #5 with respect to the intersection?", "What type of agent is surrounding agent #6?", "What is the current speed of surrounding agent #6?", "Where is surrounding agent #6 located in relation to the ego agent?", "What is the current position of surrounding agent #6 with respect to the intersection?"], "sur_a": ["Surrounding agent #0 is a vehicle.", "Surrounding agent #0 is not moving.", "Surrounding agent #0 is 12 meters in front of the ego agent and 6 meters on the right of the ego agent.", "Surrounding agent #0 is on the right of the intersection and 14 meters away from the intersection center.", "Surrounding agent #1 is a vehicle.", "Surrounding agent #1's current speed is 5 m/s.", "Surrounding agent #1 is 27 meters in front of the ego agent and 11 meters on the left of the ego agent.", "Surrounding agent #1 is at the opposite side of the intersection and 21 meters away from the intersection center.", "Surrounding agent #2 is a vehicle.", "Surrounding agent #2's current speed is 5 m/s.", "Surrounding agent #2 is 37 meters in front of the ego agent and 12 meters on the left of the ego agent.", "Surrounding agent #2 is at the opposite side of the intersection and 30 meters away from the intersection center.", "Surrounding agent #4 is a vehicle.", "Surrounding agent #4 is not moving.", "Surrounding agent #4 is 20 meters on the right of the ego agent and 10 meters in front of the ego agent.", "Surrounding agent #4 is on the right of the intersection and 27 meters away from the intersection center.", "Surrounding agent #5 is a vehicle.", "Surrounding agent #5 is not moving.", "Surrounding agent #5 is 21 meters in front of the ego agent and 16 meters on the right of the ego agent.", "Surrounding agent #5 is on the right of the intersection and 26 meters away from the intersection center.", "Surrounding agent #6 is a vehicle.", "Surrounding agent #6's current speed is 16 m/s.", "Surrounding agent #6 is 38 meters behind the ego agent.", "Surrounding agent #6 is departing from the intersection and is on the same side of the intersection as the ego agent, 45 meters away from the intersection center."], "int_q": ["What interactions are anticipated between the ego agent and surrounding agent #0 as they navigate the intersection?", "Can we expect any interaction between the ego agent and surrounding agent #1?", "What kind of interaction might occur between the ego agent and surrounding agent #2?", "How will the ego agent and surrounding agent #4 interact?", "What interaction is expected between the ego agent and surrounding agent #5?", "What will be the nature of interactions between the ego agent and surrounding agent #6?", "What will the ego agent aim to do in the upcoming moments?"], "int_a": ["Surrounding agent #0 will be passed by the ego agent as it is not moving and will be behind the ego agent in the future.", "Surrounding agent #1 will pass by the ego agent as it will be heading in the opposite direction.", "Surrounding agent #2 will have no interaction with the ego agent as they are far away heading in the opposite direction.", "Surrounding agent #4 will have no interaction with the ego agent as it is not moving and off road.", "Surrounding agent #5 will have no interaction with the ego agent as it is not moving and is off road.", "Surrounding agent #6 will have no interaction with the ego agent as it is accelerating away from the ego agent and they are heading in opposite directions.", "The ego agent intends to continue exiting the intersection. It will not need to interact with any of the surrounding agents as they are either not moving, will be behind the ego agent, or are heading in the opposite direction."]}