{"sid": "1a4dc996c883e1f", "ego": 1222, "cur_time": 1.0, "future_time": 3.0, "rel_id": [935, 976, 1222], "rel_qa_id": [0, 1, 2], "env_q": ["Can you describe the type of intersection present in the current driving scenario?", "How many stop signs are there at the intersection?", "Where is the crosswalk located in relation to surrounding agent #1?"], "env_a": ["The intersection is a 4 way intersection.", "There are 4 stop signs in the intersection.", "The crosswalk is 2 meters in front of surrounding agent #1."], "ego_q": ["What is the ego agent's current speed?", "What is the ego agent's current motion status?", "Where is the ego agent currently positioned in the intersection?", "What is the ego agent's current action within the intersection?", "Is there a stop sign affecting the ego agent's movement?"], "ego_a": ["The ego agent's current speed is 7 m/s.", "The ego agent is accelerating.", "The ego agent is in the intersection.", "The ego agent is turning left.", "The ego agent has passed a stop sign."], "sur_q": ["What type of agent is surrounding agent #0?", "What is the current speed of surrounding agent #0?", "What is the motion status of surrounding agent #0?", "Where is surrounding agent #0 in relation to the ego agent?", "What is the position of surrounding agent #0 in relation to the intersection?", "What direction is surrounding agent #0 facing in relation to the intersection?", "What type of agent is surrounding agent #1?", "What is the current speed of surrounding agent #1?", "What is the motion status of surrounding agent #1?", "Where is surrounding agent #1 in relation to the ego agent?", "What is the position of surrounding agent #1 in relation to the intersection?", "What direction is surrounding agent #1 facing in relation to the ego agent?", "Is surrounding agent #1 approaching any traffic control devices?"], "sur_a": ["Surrounding agent #0 is a vehicle.", "The current speed of surrounding agent #0 is 5 m/s.", "Surrounding agent #0 is accelerating.", "Surrounding agent #0 is 17 meters on the left and 13 meters behind the ego agent.", "Surrounding agent #0 is on the left of the intersection and 25 meters away from the intersection center.", "Surrounding agent #0 is heading the opposite direction as the ego agent and is departing from the intersection.", "Surrounding agent #1 is a vehicle.", "The current speed of surrounding agent #1 is 2 m/s.", "Surrounding agent #1 is decelerating.", "Surrounding agent #1 is 26 meters on the left and 6 meters in front of the ego agent.", "Surrounding agent #1 is on the left of the intersection and 23 meters away from the intersection center.", "Surrounding agent #1 is heading right of the ego agent.", "Surrounding agent #1 is approaching a crosswalk."], "int_q": ["What interactions will occur between the ego agent and surrounding agent #0?", "How will the ego agent and surrounding agent #1 interact as they are both near the intersection?", "What is the anticipated intention of the ego agent in the near future?"], "int_a": ["Surrounding agent #0 will have no interaction with the ego agent as they are moving in opposite directions and are not in close proximity.", "Surrounding agent #1 will yield to the ego agent because it is decelerating and approaching a stop sign, while the ego agent is already in the intersection and accelerating.", "The ego agent intends to complete its left turn and exit the intersection. It is currently ahead of a stop sign but is already in the process of moving through the intersection, indicating it has already observed the stop sign. Surrounding agent #1 will yield due to the stop sign, and there is no interaction with surrounding agent #0, so the ego agent will continue its maneuver without the need to respond to other agents."]}