{"sid": "1a0e2be1a47ad032", "ego": 30, "cur_time": 1.0, "future_time": 3.0, "rel_id": [13, 30, 10, 9, 7, 8], "rel_qa_id": [0, 1, 2, 3, 4, 5], "env_q": ["Can you describe the presence of any traffic control devices in the vicinity of the ego agent?", "What is the current position of the ego agent in relation to the lanes?"], "env_a": ["Nothing"], "ego_q": ["What is the current velocity of the ego agent?", "Could you specify the ego agent's current motion status?", "Where is the ego agent in relation to the speed bump?"], "ego_a": ["The ego agent's current speed is 7 m/s.", "It is decelerating.", "No speed bumps present."], "sur_q": ["What type of agent is surrounding agent #0?", "How fast is surrounding agent #0 currently moving?", "What is the motion status of surrounding agent #0?", "Where is surrounding agent #0 located in relation to the ego agent?", "What direction is surrounding agent #0 heading compared to the ego agent?", "What type of agent is surrounding agent #2?", "Can you tell me the speed of surrounding agent #2?", "Where is surrounding agent #2 positioned in relation to the ego agent?", "What type of agent is surrounding agent #3?", "What is the current speed of surrounding agent #3?", "Where is surrounding agent #3 in relation to the ego agent?", "What type of agent is surrounding agent #4?", "How fast is surrounding agent #4 moving at the moment?", "Can you describe the position of surrounding agent #4 with respect to the ego agent?", "What type of agent is surrounding agent #5?", "What is the current velocity of surrounding agent #5?", "Where is surrounding agent #5 located in relation to the ego agent?"], "sur_a": ["Surrounding agent #0 is a vehicle.", "Its current speed is 6 m/s.", "It is decelerating.", "It is 49 meters in front of the ego agent and 2 meters on the right.", "It is heading the opposite direction as the ego agent.", "Surrounding agent #2 is a vehicle.", "It is not moving.", "It is 9 meters on the right of the ego agent and 9 meters in front of the ego agent.", "Surrounding agent #3 is a vehicle.", "It is not moving.", "It is 16 meters behind the ego agent and 9 meters on the right.", "Surrounding agent #4 is a vehicle.", "It is not moving.", "It is 19 meters in front of the ego agent and 4 meters on the right.", "Surrounding agent #5 is a vehicle.", "It is not moving.", "It is 25 meters in front of the ego agent and 3 meters on the left."], "int_q": ["What interactions are likely to occur between the ego agent and surrounding agent #0?", "Could you describe the expected interaction between the ego agent and surrounding agent #2?", "What kind of interaction will take place between the ego agent and surrounding agent #3?", "Can you predict the interaction between the ego agent and surrounding agent #4?", "What interaction is expected between the ego agent and surrounding agent #5?", "What is the anticipated intention of the ego agent in the near future?"], "int_a": ["Surrounding agent #0 will pass the ego agent as they are heading in opposite directions and there might be a close passby.", "There will be no interaction between the ego agent and surrounding agent #2 as the latter is not moving and is positioned to the side of the ego agent.", "There will be no interaction between the ego agent and surrounding agent #3 since the latter is stationary and located to the side and behind the ego agent.", "Surrounding agent #4 will be overtaken by the ego agent as it is not moving and is positioned in the front right of the ego agent.", "Surrounding agent #5 will be passed by the ego agent as it is not moving.", "The ego agent intends to continue on its path. It will pass surrounding agent #0, which is moving in the opposite direction, and overtake surrounding agents #4, which is not moving. The ego agent does not need to interact with surrounding agents #2 and #3 as they are stationary and not in its direct path."]}