{"sid": "1a6a34413f519e1b", "ego": 4474, "cur_time": 1.0, "future_time": 3.0, "rel_id": [2132, 4474, 2122], "rel_qa_id": [0, 1, 2], "env_q": ["Can you describe the type of intersection present in the current driving scenario?", "What is the ego agent's proximity to the intersection center at the moment?", "Is there a speed bump in the vicinity of the ego agent?"], "env_a": ["The intersection is a 4 way intersection.", "The intersection center is 18.0 meters in front of the ego agent and 2.0 meters on the left.", "No."], "ego_q": ["What is the ego agent's current speed?", "What is the ego agent's current motion status?", "What is the ego agent's current activity within the intersection?", "In which direction is the ego agent moving?"], "ego_a": ["The ego agent's current speed is 6 m/s.", "It is accelerating.", "It is entering the intersection.", "The ego agent is going straight."], "sur_q": ["What type of agent is surrounding agent #0?", "How fast is surrounding agent #0 currently moving?", "What is the motion status of surrounding agent #0?", "Where is surrounding agent #0 in relation to the ego agent?", "What is the direction of travel for surrounding agent #0 relative to the ego agent?", "Where is surrounding agent #0 in relation to the intersection?", "What type of agent is surrounding agent #2?", "What is the current speed of surrounding agent #2?", "Where is surrounding agent #2 positioned in relation to the ego agent?", "What is the direction of travel for surrounding agent #2 with respect to the ego agent?", "Can you describe surrounding agent #2's position in relation to the intersection?"], "sur_a": ["Surrounding agent #0 is a vehicle.", "Its current speed is 11 m/s.", "It is moving at a constant speed.", "It is 44 meters in front of the ego agent and 3 meters on the left.", "It is heading the opposite direction as the ego agent.", "It is heading towards the intersection and is at the opposite side of the intersection.", "Surrounding agent #2 is a vehicle.", "It is not moving.", "It is 18 meters behind the ego agent and 11 meters on the right.", "It is heading right of the ego agent.", "It is on the same side of the intersection as the ego agent and is 38 meters away from the intersection center."], "int_q": ["What interactions are anticipated between the ego agent and surrounding agent #0 as they navigate the intersection?", "Considering their respective positions and statuses, what interaction will occur between the ego agent and surrounding agent #2?", "Given the current traffic situation, what is the ego agent likely to do in the near future?"], "int_a": ["Surrounding agent #0 will pass the ego agent without any interaction as they are on different paths.", "There will be no interaction between the ego agent and surrounding agent #2 as surrounding agent #2 is stationary and not in the path of the ego agent.", "The ego agent intends to continue straight in the intersection. Since surrounding agent #0 is on a different path and surrounding agent #2 is not moving, the ego agent will not need to interact with them and will proceed with its current trajectory."]}